Console.ReadLine(rr);
 
class Console {
 public static string ReadLine();
}
 
string str = Console.ReadLine();
if (...)
{
        IfTrue;
}
 
 //////////////
 
 using System, System.Console;
 
class A
{
        static void Main()
        {
 
        }
}
 
/////
 
var d = a % b;
a = 5, b = 2, d = 1
a = 10, b = 5, d = 0
 
 В цикле с клавиатуры вводится 10 целых чисел
 
 1) Вычислить процент отрицательных и положительных
 2) Чётных и нечётных
a
 
 
 Вывести на экран таблицу умножения
/// Console.Write(object)
/// int a = 7 * 7;  Console.WriteLine(a.ToString("D2"));
 
 
 If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.
 
Find the sum of all the multiples of 3 or 5 below 1000.
 
 
////
 
var r =  new Random();
                r.Next(0, 100); // [0, 100)
                r.NextDouble(); // [0.0, 1.0)
 
double[] arr = new double[20];
for (int c = 0; c < arr.Length; c++)
{
       
}
 
pastebin.com/v40qw1wY
 
1) Заполнить массив размером 10 числами. Вывести на экран среднее арифметическое элементов массива.
 
2) Заполнить массив 10 числами. Вывести на экран позицию наименьшего элемента.
 
3) Заполнить массив 10 числами. Поменять местами первый и последний элемент массива, второй и предполсдений и т.д. Показать на экран массив до и после операции.
// arr.Clone()
----
Создать массив из 20 случайных чисел. Вывести все элементы массива с чётными индексами.
 
Создать массив из 10 случайных чисел в диапазоне от -20 до 20. Определить количество, сумму и среднее арифметическое положительных элементов массива.
 
// Random r = ...; byte[] arr = new byte[100]; r.NextBytes(arr);
// char ch = (char)b[i];
// if (ch >= '0' && ch <= '9') digits++;
Создать символьный массив из 100 случайных элементов. Определить, сколько в нём цифр, букв и знаков пунктуации.
 
Написать программу, которая предлагает пользователю ввести число, и затем подсчитывает, сколько раз это число встречается в массиве на 100 случайных элементов.
 
2.? Создать два массива A и B из 5 элементов. Создать третий массив C из 10 элементов, в который копируются элементы из первого и второго массива поочередно (например, С[0]=A[0], c[1]=B[0], C[2]=A[1], C[3]=B[1] и т.д.).
Было 1 2 3 4 5 и 10 11 12 13 14
Стало 1 10 2 11 3 12 4 13 5 14
 
3.? Написать программу, копирующую один массив в другой следующим образом: сначала копируются последовательно все элементы, большие 0, затем последовательно все элементы, равные 0, а затем последовательно все элементы, меньшие 0.
 
Было 5 6 -3 0 -9 4 -2 2 0 7 8 -4
 
Стало -3 -9 -2 -4 0 0 5 6 4 2 7 8
 
4.? Написать программу, копирующую последовательно элементы одного массива размером 10 элементов в 2 массива размером 5 элементов каждый (задача, обратная 2).
 
 
/// int a;
/// a = a + 10; <-> a += 10;
/// a = a + 1; <-> a += 1; <-> ++a;
 
int a = 10;
int b = a++;
b == 10, a == 11;
 
int c = 10;
b = ++c;
c == 11, b = 11
 
/////
 
foreach (var element in yourArray)
        Console.WriteLine(element);
 
foreach (var element in yourArray)
{
        Console.WriteLine(element);
        ...
}
//////
 
static void MinMax(ref int min, ref int max)
{
        if (min > max)
        {
                swap;
        }
}
 
int a = 10, b = 4;
MinMax(ref a, ref b);
 
// b = 4, a = 10;